{"version":1,"resource":"file:///home/monteiro/codes/tcc_zoo/lib/models/lancamento_diario.dart","entries":[{"id":"nYXf.dart","source":"Chat Edit: ' descreva com os minimos detalhes, ate com as formulas, crie um prompt para criar um aplicativo flutter\n\nObrigado por fornecer os dados detalhados da sua planilha de custos de produção de avicultura. Com base nesses arquivos, o aplicativo Flutter ideal seria um Sistema de Gestão de Produção e Avaliação Econômico-Financeira para Avicultura.\n\nAbaixo está a descrição detalhada, as fórmulas essenciais e o prompt completo para a criação do aplicativo em Flutter.\n\n1. Descrição Detalhada do Aplicativo Flutter\n\nNome Proposto: AviGestor - Controle de Lotes e Finanças\n\nObjetivo: Converter a planilha de custos de produção e avaliação econômica-financeira em um aplicativo móvel (Flutter) que permita o lançamento de dados diários de produção e a visualização instantânea de indicadores de desempenho e resultados financeiros.\n\nMódulos Principais e Dados da Planilha\n\nMódulo\tBase da Planilha\tFuncionalidade no App\nControle de Lotes\tFicha para controle de produção\tTela de lançamento de dados diários (Mortalidade, Consumo de Ração, Peso).\nCadastro Financeiro\tInvestimentos, Custos, Previsão de receita\tTelas para registrar Custos Fixos, Investimento Fixo Inicial e parâmetros de Receita.\nRelatórios Financeiros\tAvaliação Econômica Financeira\tPainéis de visualização dos resultados e indicadores-chave (Profitabilidade, Ponto de Equilíbrio).\n\nEstrutura de Dados e Fórmulas Essenciais\n\nO aplicativo deve utilizar as seguintes fórmulas (extraídas ou deduzidas dos seus quadros):\n\nA. Receita Total (Por Lote)\n\nA Receita por Lote é calculada com base na quantidade final de aves, seu peso médio e a venda da cama de aviário.\n\n    Quantidade Final de Aves (Qfinal​):\n    Qfinal​=Qinicial​×100Aproveitamento(%)​\n\n    Onde:\n\n        Qinicial​ é a Quantidade Inicial de Aves.\n\n        Aproveitamento(%) é o percentual de aproveitamento (ex.: 97%).\n\n    Peso Médio Total do Lote em Kg (Plote​):\n    Plote​=Qfinal​×Pfrango​\n\n    Onde:\n\n        Pfrango​ é o Peso médio do frango vivo (Kg).\n\n    Receita Total por Lote (Rlote​):\n    Rlote​=(Plote​×Vfrango​)+Rcama​\n\n    Onde:\n\n        Vfrango​ é o Valor Frango Vivo (Kg) (Receita Média).\n\n        Rcama​ é a Receita Média da Cama de Aviário.\n\nB. Avaliação Econômico-Financeira (Trimestral)\n\nA avaliação é baseada no cálculo dos resultados operacionais, como visto no Quadro 10.\n\n    Margem de Contribuição (MCT​):\n    MCT​=RTotal,T​−CVTotal,T​\n\n    Onde:\n\n        RTotal,T​ é a Receita Total Trimestral (Rlote​×Nº Lotes/Trimestre).\n\n        CVTotal,T​ são os Custos Variáveis Totais Trimestrais (obtidos no cálculo de Custos Variáveis).\n\n    Lucro Antes do Imposto de Renda (LAIRT​):\n    LAIRT​=MCT​−CFTotal,T​\n\n    Onde:\n\n        CFTotal,T​ são os Custos Fixos Totais Trimestrais (CFMensal​×3).\n\n    Lucro Líquido Total (LLT​):\n    LLT​=LAIRT​−(LAIRT​×15%)\n\n    (Considerando a alíquota de 15% como no seu exemplo, mas deve ser configurável).\n\nC. Indicadores de Desempenho (KPIs)\n\nApresentados no Quadro 11.\n\n    Lucratividade (L):\n    Lucratividade=RTotal,T​LLT​​×100\n\n    Ponto de Equilíbrio Operacional (PEO​):\n    PEO​=MCT​CFTotal,T​​\n\n    Nota: Este indicador é um percentual da Receita Total que cobre os Custos Fixos.\n\n    Prazo de Retorno do Investimento em Meses (PRImeses​):\n    PRImeses​=3LLT​​InvestimentoTotal​​\n\n    Onde:\n\n        InvestimentoTotal​ é o valor total de Investimento (ex: R$ 23.577,04, do Quadro 2).\n\n        3LLT​​ é o Lucro Líquido Médio Mensal.\n\n2. Prompt Detalhado para Criação do Aplicativo Flutter\n\nUse o seguinte prompt para um modelo de código ou ferramenta de geração de aplicativos:\n\nCrie um aplicativo mobile completo em Flutter (Dart) chamado \"AviGestor\", focado em um sistema de gestão de custos e produção para avicultura, baseado nas funcionalidades e fórmulas detalhadas.\n\n**Requisitos Fundamentais:**\n\n1.  **Estrutura de Projeto:**\n    * Utilize a arquitetura **Provider** ou **Riverpod** para Gerenciamento de Estado.\n    * O aplicativo deve ser dividido em Módulos (Lotes, Finanças, Relatórios).\n    * Implementação de persistência local de dados (SQLite via `sqflite` ou Hive) para armazenar todos os registros e configurações.\n\n2.  **Módulo 1: Controle de Lotes (Produção)**\n    * **Tela de Cadastro de Lote:** Campos para `Mês e ano`, `Lote`, `Galpão`, `Linhagem`, `Data de nascimento`, `Quantidade Inicial de Aves`.\n    * **Tela de Lançamento Diário:** Para um lote selecionado, permitir o lançamento diário/semanal dos dados conforme a planilha:\n        * `Mortos` (Aves)\n        * `Consumo de Ração Real` (gramas)\n        * `Peso das Aves` (Kg)\n\n3.  **Módulo 2: Cadastro Financeiro (Configurações)**\n    * **Tela de Custos Fixos:** Formulário para registrar os itens do `Quadro 6` (Telefone, Contabilidade, Pró-labore, etc.) e calcular o `Custo Fixo Total Mensal (CF_{Mensal})`.\n    * **Tela de Investimentos:** Cadastro do `Investimento Total Inicial (Investimento_{Total})` (ex: R$ 23.577,04), usado no cálculo do `PRI`.\n    * **Tela de Parâmetros de Receita:** Campos de configuração global para o cálculo da Receita: `Aproveitamento (%)`, `Peso médio do frango vivo (Kg)`, `Valor Frango Vivo (Kg) (V_{frango})`, `Receita Cama de Aviário (R_{cama})`.\n\n4.  **Módulo 3: Relatórios e Indicadores (Dashboard)**\n    * Crie um Dashboard que exiba os principais resultados do último trimestre/lote fechado.\n    * **Cálculo (Com Fórmulas):** O aplicativo deve realizar os cálculos a seguir, utilizando os dados de Produção (para Custos Variáveis) e os dados de Configuração (para Custos Fixos e Receitas):\n        * **Receita Total Trimestral ($R_{Total, T}$)**\n        * **Margem de Contribuição Trimestral ($MC_{T}$)**\n        * **Lucro Líquido Trimestral ($LL_{T}$)**, aplicando a fórmula do Imposto de Renda.\n    * **Exibição dos KPIs (Quadro 11):** Apresentar em destaque os resultados de:\n        * **Lucratividade**\n        * **Ponto de Equilíbrio Operacional**\n        * **Prazo de Retorno do Investimento (PRI)**\n\n5.  **Design e UX (Experiência do Usuário):**\n    * Utilize um tema simples e profissional, com cores verdes e cinzas (associadas à agricultura/negócios).\n    * Gráficos de linha (usando `fl_chart`) para visualizar a evolução do `Peso das Aves` e do `Consumo de Ração` em relação ao previsto.\n    * Use cards e ícones para facilitar a visualização dos indicadores (KPIs).\n\n**Saída Esperada:** O código-fonte completo do projeto Flutter, incluindo a estrutura de pastas, classes de modelo (Lote, CustoFixo), o Provider/Riverpod para o estado financeiro e as telas de UI.\n'","timestamp":1760715042432}]}